In [39]:
import pandas as pd

In [40]:
def add_product(product_info, df):
    product_info_list = product_info.split(' ')
    df = df.append({'product': product_info_list[0],
                    'country':product_info_list[1],
                    'price_kg':float(product_info_list[2]),
                    'available_kg':float(product_info_list[3]),
                    'total_price': (float(product_info_list[2])*float(product_info_list[3]))},
                    ignore_index = True)

    return df

def print_by_country(df, country):
    print(df[(df['country'] == country)])

def delete_product(df, product):
    df = df[(df['product'] != product)]
    return df

In [41]:
products = ['apples', 'bananas', 'pears', 'peaches']
country = ['New Zealand', 'Equador', 'China', 'China']
price = [161.3, 48.5, 57.0, 120.1]
amount = [34.5, 21.2, 31.0, 12.1]
df = pd.DataFrame(columns=['product', 'country', 'price_kg', 'available_kg'])

In [42]:
df['product'] = products
df['country'] = country
df['price_kg'] = price
df['available_kg'] = amount

In [43]:
df['total_price'] = df['price_kg'] * df['available_kg']

In [44]:
df = add_product('strawberry Russia 264.2 21.0',  df)

In [45]:
df

      product      country  price_kg  available_kg  total_price
0      apples  New Zealand     161.3          34.5      5564.85
1     bananas      Equador      48.5          21.2      1028.20
2       pears        China      57.0          31.0      1767.00
3     peaches        China     120.1          12.1      1453.21
4  strawberry       Russia     264.2          21.0      5548.20

In [46]:
df = delete_product(df, 'apples')

In [47]:
df

      product  country  price_kg  available_kg  total_price
1     bananas  Equador      48.5          21.2      1028.20
2       pears    China      57.0          31.0      1767.00
3     peaches    China     120.1          12.1      1453.21
4  strawberry   Russia     264.2          21.0      5548.20